In [2]:
import pandas as pd
from db import DemoDB

In [7]:
database = DemoDB()

Indexing schema. This will take a second...finished!

In [8]:
database.tables

Refreshing schema. Please wait...done!

+--------+---------------+----------------------------------------------------------------------------------+
| Schema | Table         | Columns                                                                          |
+--------+---------------+----------------------------------------------------------------------------------+
| public | Album         | AlbumId, Title, ArtistId                                                         |
| public | Artist        | ArtistId, Name                                                                   |
| public | Customer      | CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalC |
|        |               | ode, Phone, Fax, Email, SupportRepId                                             |
| public | Employee      | EmployeeId, LastName, FirstName, Title, ReportsTo, BirthDate, HireDate, Address, |
|        |               |  City, State, Country, PostalCode, Phone, Fax, Email                             |
| public | Genre         | GenreId, Name                                                                    |
| public | Invoice       | InvoiceId, CustomerId, InvoiceDate, BillingAddress, BillingCity, BillingState, B |
|        |               | illingCountry, BillingPostalCode, Total                                          |
| public | InvoiceLine   | InvoiceLineId, InvoiceId, TrackId, UnitPrice, Quantity                           |
| public | MediaType     | MediaTypeId, Name                                                                |
| public | Playlist      | PlaylistId, Name                                                                 |
| public | PlaylistTrack | PlaylistId, TrackId                                                              |
| public | Track         | TrackId, Name, AlbumId, MediaTypeId, GenreId, Composer, Milliseconds, Bytes, Uni |
|        |               | tPrice                                                                           |
+--------+---------------+----------------------------------------------------------------------------------+

In [9]:
album = database.tables.Album.all()

In [10]:
album.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [11]:
artist = database.tables.Artist.all()

In [12]:
artist.head()

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

In [14]:
album_artist = pd.merge(artist, album)

In [15]:
album_artist.head()

   ArtistId       Name  AlbumId                                  Title
0         1      AC/DC        1  For Those About To Rock We Salute You
1         1      AC/DC        4                      Let There Be Rock
2         2     Accept        2                      Balls to the Wall
3         2     Accept        3                      Restless and Wild
4         3  Aerosmith        5                               Big Ones

In [16]:
album_artist = pd.merge(artist, album, on='ArtistId')

In [18]:
album_artist.head()

   ArtistId       Name  AlbumId                                  Title
0         1      AC/DC        1  For Those About To Rock We Salute You
1         1      AC/DC        4                      Let There Be Rock
2         2     Accept        2                      Balls to the Wall
3         2     Accept        3                      Restless and Wild
4         3  Aerosmith        5                               Big Ones

In [21]:
album.rename(columns={'ArtistId': 'Artist_Id'}, inplace=True)

In [23]:
album.head()

   AlbumId                                  Title  Artist_Id
0        1  For Those About To Rock We Salute You          1
1        2                      Balls to the Wall          2
2        3                      Restless and Wild          2
3        4                      Let There Be Rock          1
4        5                               Big Ones          3

In [25]:
album_artist = pd.merge(album, artist, left_on='Artist_Id', right_on='ArtistId')

In [27]:
album_artist.head()

,AlbumId,Title,Artist_Id,ArtistId,Name
0,1,For Those About To Rock We Salute You,1,1,AC/DC
1,4,Let There Be Rock,1,1,AC/DC
2,2,Balls to the Wall,2,2,Accept
3,3,Restless and Wild,2,2,Accept
4,5,Big Ones,3,3,Aerosmith

In [29]:
album_artist = pd.merge(album, artist, left_on='Artist_Id', right_on='ArtistId').drop('ArtistId', axis=1)

In [30]:
album_artist.head()

   AlbumId                                  Title  Artist_Id       Name
0        1  For Those About To Rock We Salute You          1      AC/DC
1        4                      Let There Be Rock          1      AC/DC
2        2                      Balls to the Wall          2     Accept
3        3                      Restless and Wild          2     Accept
4        5                               Big Ones          3  Aerosmith

In [31]:
alunos1 = pd.DataFrame(
    {
        'nome': ['Maria', 'Sofia'],
        'nota': [8,9],
    }    
)

alunos2 = pd.DataFrame(
    {
        'nome': ['João', 'Pedro', 'Maria'],
        'cod': [1,2,3]
    }
)

In [33]:
alunos_total = pd.merge(alunos1, alunos2, on='nome')

In [34]:
alunos_total.head()

    nome  nota  cod
0  Maria     8    3

In [35]:
alunos_total = pd.merge(alunos1, alunos2, on='nome', how='left')

In [37]:
alunos_total

    nome  nota  cod
0  Maria     8  3.0
1  Sofia     9  NaN

In [38]:
alunos_total = pd.merge(alunos1, alunos2, on='nome', how='outer')

In [39]:
alunos_total

    nome  nota  cod
0  Maria   8.0  3.0
1  Sofia   9.0  NaN
2   João   NaN  1.0
3  Pedro   NaN  2.0